---
kind: type
id: T:Autodesk.Revit.DB.Visual.LayeredNdfType
source: html/383ff329-5f89-7d95-7b0e-dcdcfc3b219f.htm
---
# Autodesk.Revit.DB.Visual.LayeredNdfType

The enumerated type representing the permitted values for the asset property "LayeredNdfType" from the "AdvancedLayered" schema.

## Syntax (C#)
```csharp
public enum LayeredNdfType
```